set @a1 = 1000, @b1 = 2000;
set @a2 = null, @b2 = 2000;
set @a3 = null, @b3 = null;
set @a4 = 2000, @b4 = 2000;

select 'Равны? (@a=@b) (не верное использование)' as 'опреация\\четыре варианта:', @a1=@b1 as `№1 нет`, @a2=@b2 as `№2 нет`, @a3=@b3 as `№3 да`, @a4=@b4 as `№4 да`
union all
select 'Равны?' as `опреация`, @a1<=>@b1 as `@1`, @a2<=>@b2 as `@2`, @a3<=>@b3 as `@3`, @a4<=>@b4 as `@4`
union all
select 'Не равны? (не верное использование)' as `опреация`, !@a1<=>@b1 as `@1`, !@a2<=>@b2 as `@2`, !@a3<=>@b3 as `@3`, !@a4<=>@b4 as `@4`
union all
select 'Не равны?' as `опреация`, !(@a1<=>@b1) as `@1`, !(@a2<=>@b2) as `@2`, !(@a3<=>@b3) as `@3`, !(@a4<=>@b4) as `@4`
union all
select 'Не равны?' as `опреация`, @a1<=>@b1<>1 as `@1`, @a2<=>@b2<>1 as `@2`, @a3<=>@b3<>1 as `@3`, @a4<=>@b4<>1 as `@4`
union all
select 'Не равны?' as `опреация`, NOT @a1<=>@b1 as `@1`, NOT @a2<=>@b2 as `@2`, NOT @a3<=>@b3 as `@3`, NOT @a4<=>@b4 as `@4`
;